Tekla Open API Reference for Tekla Structures 2025
ICurve Properties
The ICurve type exposes the following members.
Properties
Name | Description
EndPoint
 Gets the end point of the curve. May be the same as StartPoint if the curve is closed.
Length
 Gets the length of the curve
StartPoint
 Gets the start point of the curve
Top
See Also
Reference
ICurve Interface
Tekla.Structures.Geometry3d Namespace